/* Error string for OTR message string */
"A private conversation could not be set up." = "无法建立加密会话";

/* Title for the about page */
"About" = "关于";

/* Label for button to show version numbers and licenses */
"About This Version" = "关于此版本";

/* SSL error message */
"Access denied" = "权限被据";

/* The string describing a buddy's account */
"Account" = "账户";

/* Title for the accounts tab */
"Accounts" = "账户";

/* Button title to add someone as a buddy */
"Add" = "添加";

/* The title for the view to add a buddy */
"Add Buddy" = "加好友";

/* Label for button to create account by logging into an existing account */
"Add Existing Account" = "Add Existing Account";

/* String to describe advanced set of settings */
"Advanced" = "高级";

/* No comment provided by engineer. */
"Advanced Encryption Settings" = "Advanced Encryption Settings";

/* Error string for OTR message string */
"An error occured while encrypting a message and the message was not sent." = "加密此消息时出现了错误，此消息未成功发送。";

/* SSL error message */
"Attempt to restore an unknown session" = "尝试还原连接";

/* Title for automatic conversation deletion setting */
"Auto-delete" = "自动删除";

/* Label in buddy list for users that are available */
"Available" = "在线";

/* Label in buddy list for users that are away */
"Away" = "离开";

/* SSL error message */
"Bad certificate format" = "证书格式错误";

/* SSL error message */
"Bad MAC" = "MAC错误";

/* SSL error message */
"Bad protocol version" = "协议版本错误";

/* SSL error message */
"Bad SSLCipherSuite" = "SSLCipherSuite";

/* SSL error message */
"Bad unsupported cert format" = "不支持的证书格式。";

/* string to describe basic set of settings */
"Basic" = "基本";

/* username section */
"Basic Setup" = "Basic Setup";

/* Text describing what happens when the user has forgotten the passphrase */
"Because the database contents is encrypted with your passphrase, you've lost access to your data and will need to delete and reinstall ChatSecure to continue. Password managers like 1Password or MiniKeePass can be helpful for generating and storing strong passwords." = "由于数据库内容使用您定义的密码加密，您已丢失对数据的访问，并且需要删除并重新安装ChatSecure以继续。密码管理器，如1Password或者MiniKeePass，可以帮助您生成并存贮健壮的密码。";

/* No comment provided by engineer. */
"Best Available" = "Best Available";

/* The String for a button to block a buddy */
"Block" = "屏蔽";

/* The String for a buddy to block and remove a buddy from the buddy list */
"Block & Remove" = "屏蔽并删除";

/* The title for the view that shows detailed buddy info */
"Buddy Info" = "好友信息";

/* Cancel an alert window */
"Cancel" = "取消";

/* Error string for OTR message string */
"Cannot read the received message." = "无法查看已收到的消息。";

/* Error string for OTR message string */
"Cannot recognize the type of OTR message received." = "无法识别收到的OTR消息类型。";

/* SSL error message */
"Cert chain not verified by root" = "证书链未被root验证";

/* SSL error message */
"Certificate expired" = "证书已过期";

/* SSL error message */
"Certificate revoked" = "证书已撤销";

/* SSL error message */
"Chain had a cert not yet valid" = "链中有证书尚未生效";

/* SSL error message */
"Chain had an expired cert" = "链中有证书已过期";

/* Title for chat view */
"Chat" = "聊天";

/* Body of SMS or email when sharing a link to the app */
"Chat with me securely" = "加密的聊天应用";

/* Title for chats view */
"Chats" = "会话";

/* Title for ChatSecure Push (this probably doesnt need to be translated) */
"ChatSecure Push" = "ChatSecure推送";

/* let users know source is on Github */
"Check out the source here on Github" = "连接至 Github 查看源代码";

/* server selection footer */
"Choose from our list of trusted servers, or use your own." = "Choose from our list of trusted servers, or use your own.";

/* title for server selection screen */
"Choose Server" = "Choose Server";

/* SSL error message */
"Cipher Suite negotiation failure" = "Cipher Suite设置失败";

/* Label for text field where you compose a new message */
"Compose" = "发起会话";

/* SSL error message */
"Configuration error" = "设置错误";

/* String for button to connect connect */
"Connect" = "Connect";

/* Whether or not account is logged in */
"Connected" = "已连接";

/* String to state if an account is progress of creating a connection */
"Connecting" = "连接中";

/* Message shown when connecting to the Tor network */
"Connecting to Tor" = "建立Tor连接中";

/* SSL error message */
"Connection closed gracefully" = "成功断开连接";

/* SSL error message */
"Connection closed via error" = "连接出错，已断开";

/* Copy string to clipboard as in copy and paste */
"Copy" = "复制";

/* No comment provided by engineer. */
"Could not decrypt database. If the app is not working properly, you may need to delete and reinstall." = "Could not decrypt database. If the app is not working properly, you may need to delete and reinstall.";

/* Error message when cannot get public key from SSL certificate */
"Could not retrieve public key from certificate" = "无法从证书中提取公共匙";

/* No comment provided by engineer. */
"Crash Detected" = "Crash Detected";

/* Title for button to create account */
"Create" = "注册";

/* Label for button to create a new account via in band registration */
"Create New Account" = "注册账户";

/* Start of sentence that will be followed by names */
"Created by" = "创建者：";

/* Title for progress of creating a new account */
"Creating Account" = "注册账户中";

/* Place holder label for custom domains */
"Custom" = "Custom";

/* if you want to change your username */
"Customize Username" = "Customize Username";

/* No comment provided by engineer. */
"Database Error" = "Database Error";

/* SSL error message */
"Decoding error" = "解密错误";

/* SSL error message */
"Decompression failure" = "解压失败";

/* SSL error message */
"Decryption error" = "解密错误";

/* SSL error message */
"Decryption failed" = "解密失败";

/* SSL error message */
"Decryption failure" = "解密失败";

/* default string to revert to normal language behaviour */
"Default" = "默认";

/* Ask user if they want to delete the stored account information */
"Delete Account?" = "删除账号？";

/* Description for automatic conversation deletion */
"Delete chats on disconnect" = "断开时删除聊天記錄";

/* Shows in the chat view when a message has been delivered */
"Delivered" = "已送达";

/* Default message when a user status is set to do not disturb */
"Do Not Disturb" = "请勿打扰";

/* No comment provided by engineer. */
"Don't change these unless you really know what you're doing. By default we will always select the best available encryption method." = "Don't change these unless you really know what you're doing. By default we will always select the best available encryption method.";

/* Title for donation link */
"Donate" = "捐款";

/* Title for button to press when user is finished */
"Done" = "完成";

/* The string describing account name or email address for a buddy */
"Email" = "邮箱";

/* enable permission */
"Enable" = "Enable";

/* button for enabling push messages */
"Enable Push" = "Enable Push";

/* button for enabling push messages in iOS system settings */
"Enable Push in Settings" = "Enable Push in Settings";

/* No comment provided by engineer. */
"Enable Tor" = "Enable Tor";

/* Generic title for encryption errors */
"Encryption Error" = "加密出现错误";

/* The placeholder text for the text field to enter a group chat name or label */
"Enter a group name" = "Enter a group name";

/* Title of error message pop-up box */
"Error" = "Error";

/* title label for error when creating account */
"Error Creating Account" = "注册账户失败";

/* SSL error message */
"Export restriction" = "导出限制";

/* Default message when a user status is set to extended away */
"Extended Away" = "远远离开";

/* the name for facebook */
"Facebook" = "Facebook";

/* Message when cannot connect to XMPP server */
"Failed to connect to XMPP server. Please check your login credentials and internet connection and try again." = "连接 XMPP 服务器失败, 请检查您的帐户名与密码及网络连接后再尝试登录。";

/* SSL error message */
"Fatal alert" = "关键错误";

/* Label for button when you've forgotten the passphrase */
"Forgot Passphrase?" = "忘记密码？";

/* whether or not we should generate a strong password for them */
"Generate Secure Password" = "Generate Secure Password";

/* Name of popular web based hosting service */
"GitHub" = "GitHub";

/* the name for Google talk */
"Google Talk" = "Google Talk";

/* a subtitle label for a group chat */
"Group Chat" = "Group Chat";

/* The title for the view to enter a group chat name or label */
"Group Name" = "Group Name";

/* SSL error message */
"Handshake failure" = "交互失败";

/* Label for button to open link to translate app */
"Help Translate" = "帮助翻译";

/* Label for button to hold to record audio */
"Hold to talk" = "Hold to talk";

/* Label text for hostname field on login scree */
"Hostname" = "主机名";

/* SSL error message */
"I/O would block (not fatal)" = "I/O端口封闭";

/* SSL error message */
"Illegal parameter" = "参数不合法";

/* Label for incoming data transfers */
"Incoming" = "Incoming";

/* Short for information, button title to get more information */
"Info" = "详情";

/* SSL error message */
"Insufficient buffer provided" = "提供的缓存不够";

/* SSL error message */
"Insufficient security" = "不够安全";

/* SSL error message */
"Internal error" = "内部错误";

/* SSL error message */
"Invalid certificate chain" = "未生效的证书链";

/* title label for invalid email */
"Invalid Email" = "无效的电子邮件";

/* the name for jabber, also include (XMPP) at the end */
"Jabber (XMPP)" = "Jabber（XMPP）";

/* Label for button after to send push notification knock. Like knocking on a door */
"Knock" = "Knock";

/* Text for label after knock is sent. Like knocking on a door */
"Knock Sent" = "Knock Sent";

/* string to bring up language selector */
"Language" = "语言";

/* log in to account */
"Log In" = "登录";

/* log out from account */
"Log Out" = "注销";

/* Label for account setting that autologins on launch */
"Login Automatically" = "自动登录";

/* Title for button to manage ChatSecure Push account */
"Manage ChatSecure Push account" = "管理推送账户";

/* subtitle for the certificate pinned setting */
"Manage saved SSL certificates" = "管理SSL证书";

/* No comment provided by engineer. */
"Me" = "Me";

/* Error string for OTR message string */
"Message has not been sent because our buddy has ended the private conversation. We should either close the connection, or refresh it." = "消息发送失败。因为对方已经离开加密会话。你应关闭连接，或重新刷新。";

/* microphone permission is disabled */
"Microphone Disabled" = "Microphone Disabled";

/* SSL error message */
"Miscellaneous bad certificate" = "不合法的证书";

/* SSL error message */
"Module attach failure" = "模块加载失败";

/* Your QR code */
"My QR Code" = "My QR Code";

/* The string describing a buddy's display name */
"Name" = "昵称";

/* For a new settings value */
"New" = "新";

/* Title for New Account View */
"New Account" = "添加账号";

/* Title for alert when a new SSL certificate is encountered */
"New SSL Certificate" = "新的SSL证书";

/* Label for button to go to next step */
"Next" = "下一步";

/* for choosing your XMPP vCard display name */
"Nickname" = "Nickname";

/* SSL error message */
"No Error" = "无错";

/* SSL error message */
"No renegotiation allowed" = "禁止重来";

/* Label in buddy list for users that are offline */
"Offline" = "离线";

/* Accept the dialog */
"OK" = "确定";

/* For an old settings value */
"Old" = "旧";

/* Label to open link in the chrome web browser */
"Open in Chrome" = "在Chrome浏览器中打开";

/* Label for button to open link in facebook app */
"Open in Facebook" = "在Facebook中打开";

/* Label for button to open link in twitter app */
"Open in Twitter" = "在Twitter中打开";

/* Hint text for domain field telling user this field is not required */
"Optional" = "可选项";

/* Title for other miscellaneous settings group */
"Other" = "其他";

/* Error string for OTR message string */
"Our policy requires encryption but we are trying to send an unencrypted message out." = "我们的策略要求加密,但是我们正在尝试发送一个未加密的消息";

/* Label text for password field on login screen */
"Password" = "密码";

/* SSL error message */
"Peer cert is valid, or was ignored if verification disabled" = "Peer cert通过认证或根本没认证";

/* SSL error message */
"Peer dropped connection before responding" = "节点在回应前丢弃链接";

/* SSL error message */
"Peer host name mismatch" = "节点";

/* String for XMPP buddies when adding buddy is pending */
"Pending Approval" = "等待通过验证";

/* Ask user if they want to delete the stored account information */
"Permanently delete" = "永久删除";

/* Label for button to open up photo library and choose photo */
"Photo Library" = "Photo Library";

/* Button Lable to show all pinned SSL certificates */
"Pinned Certificates" = "已绑定证书";

/* Label for messages that are not encrypted */
"plaintext" = "plaintext";

/* No comment provided by engineer. */
"Plaintext (Opportunistic OTR)" = "Plaintext (Opportunistic OTR)";

/* No comment provided by engineer. */
"Plaintext Only" = "Plaintext Only";

/* detail title label for invalid email */
"Please choose a valid email address" = "请选择一个有效的电子邮件地址";

/* Label for port number field for connecting to service */
"Port" = "端口";

/* title for contacts profile view */
"Profile" = "Profile";

/* Title for push-messaging related settings */
"Push" = "推送";

/* Label for qr code image */
"QR code" = "二维码";

/* Error string for OTR message string */
"Received a general OTR error." = "接收到一个常规OTR错误";

/* Error string for OTR message string */
"Received a heartbeat." = "接收到一个心跳包";

/* Error string for OTR message string */
"Received an encrypted message but cannot read it because no private connection is established yet." = "由于加密连接失败，无法读取收到的加密信息";

/* Error string for OTR message string */
"Received an unencrypted message." = "接受到一个未加密的消息";

/* Error string for OTR message string */
"Received and discarded a message intended for another instance." = "收到别人的信息，所以弃毁";

/* Error string for OTR message string */
"Received our own OTR messages." = "收到我们自己的OTR信息";

/* Title for header of Buddy list view with Recent Buddies */
"Recent" = "最近会话";

/* SSL error message */
"Record overflow" = "纪录异常";

/* Button title to reject a request such as a buddy request */
"Reject" = "拒绝";

/* Label for instruction to delete current recording */
"Release to delete" = "Release to delete";

/* Label for instruction to send current audio */
"Release to send" = "Release to send";

/* Label for switch to save passphrase */
"Remember Passphrase" = "记住密码";

/* label for switch for whether or not we should save their password between launches */
"Remember password" = "记住密码";

/* The String for a button to remove a buddy from the buddy list */
"Remove" = "删除";

/* No comment provided by engineer. */
"Removed By Server" = "Removed By Server";

/* Reply to an incoming message */
"Reply" = "回复";

/* String to let user know a certain field like a password is required to create an account */
"Required" = "必填";

/* Label for button to resend message. */
"Resend" = "Resend";

/* Ttitle for alert view to resend a message */
"Resend Message" = "Resend Message";

/* Describe what resending will do the %@ will be replaced withe the method OTR/OMEMO/Plaintext */
"Resending this message will use %@." = "Resending this message will use %@.";

/* Label for text input for XMPP resource */
"Resource" = "XMPP资源";

/* Title for button for saving a setting */
"Save" = "保存";

/* Title for listing the user saved SSL certificates */
"Saved Certificates" = "已保存的证书";

/* Label for sharing via QR Code */
"Scan QR" = "Scan QR";

/* Label for text field where you search for a buddy */
"Search" = "搜索";

/* Title heading in settings */
"Security" = "安全";

/* Title of alert box warning about security issues */
"Security Warning" = "安全警告";

/* The placeholder text in the chat view where the message should go */
"Send %@ encrypted message" = "Send %@ encrypted message";

/* String on button to email feedback */
"Send Feedback" = "发送反馈";

/* The placeholder text in the chat view where the message should go */
"Click here to type something..." = "Click here to type something...";

/* Label text for when a transfer is in progress (normally followed by a percent value 34%) */
"Sending" = "Sending";

/* Error string for OTR message string */
"Sent a heartbeat." = "发送";

/* server selection section title */
"Server" = "Server";

/* SSL error message */
"Server closed session with no notification" = "服务器在无人和通知的情况下关闭了链接";

/* SSL error message */
"Server has requested a client cert" = "服务器要求一个客户端证书";

/* Title for the Settings screen */
"Settings" = "设置";

/* Title for sharing a link to the app */
"Share" = "分享";

/* Label for inviting friends via URL */
"Share Invite" = "Share Invite";

/* No comment provided by engineer. */
"Show Advanced Encryption Settings" = "Show Advanced Encryption Settings";

/* toggle switch for show advanced */
"Show Advanced Options" = "Show Advanced Options";

/* title label for signing up for a new account */
"Sign Up" = "登入新账户";

/* Label for button to skip this step */
"Skip" = "跳过";

/* A placeholder for a buddy's username like Someone wants to chat. */
"Someone" = "Someone";

/* SSL error message */
"SSL protocol error" = "SSL协议错误";

/* Label for button to take a photo from camera */
"Take Photo" = "Take Photo";

/* No comment provided by engineer. */
"The app crashed last time it was launched. Send a crash report?" = "The app crashed last time it was launched. Send a crash report?";

/* Error string for OTR message string */
"The message received contains malformed data." = "收到的信息含有非正常数据";

/* Error string for OTR message string */
"The previous message was resent." = "前一条信息被重新发送";

/* Error message for when in band registration is not supported */
"The XMPP server does not support in-band registration" = "这个XMPP服务器不支持内置注册";

/* basic setup selection footer */
"Think of a unique nickname that you don't use anywhere else and doesn't contain personal information." = "Think of a unique nickname that you don't use anywhere else and doesn't contain personal information.";

/* Error message when trying to make a purchase but payments haven't been set up yet */
"This device doesn't seem to be configured to make payments." = "这个设备看起来没被设置可以支付";

/* Error message description */
"This message was received from an untrusted device." = "This message was received from an untrusted device.";

/* Error message description */
"This message was sent to an untrusted device." = "This message was sent to an untrusted device.";

/* microphone permission is disabled */
"To use this feature you must re-enable microphone permissions." = "To use this feature you must re-enable microphone permissions.";

/* Message for warning about using tor network */
"Tor is an experimental feature, please use with caution." = "您正在使用试验功能，不小心可能会出错";

/* Name of the popular social tweeting site */
"Twitter" = "Twitter";

/* Title for error message */
"Unable to Send Message" = "Unable to Send Message";

/* SSL error message */
"Underlying cryptographic error" = "下层解码错误";

/* SSL error message */
"Unexpected (skipped) record in DTLS" = "数据包传输层安全性协议(即DTLS)的纪录层中存在异常纪录";

/* SSL error message */
"Unexpected message received" = "收到异常的消息";

/* SSL error message */
"Unknown Cert Authority" = "未知证书签发机构";

/* SSL error message */
"Unknown certificate" = "未知证书";

/* Describes an error without a known cause */
"Unknown Error" = "Unknown Error";

/* Label for button to unlock app */
"Unlock" = "解锁";

/* shown when invite QR code doesnt work */
"Unrecognized Invite Format" = "Unrecognized Invite Format";

/* Title for error message */
"Untrusted Device" = "Untrusted Device";

/* SSL error message */
"User canceled" = "用户取消";

/* Example of a username using the words user and example */
"user@example.com" = "用户名@example.com";

/* Label text for username field on login screen */
"Username" = "用户名";

/* SSL error message */
"Valid cert chain, untrusted root" = "有效的证书链，不信任的根证书";

/* shown to show that the certificate was valid to the system */
"Valid certificate" = "有效的证书";

/* To let the user know the fingerprint as been checked */
"Verified" = "已验证";

/* Shown when verifying fingerprints */
"Verify" = "验证";

/* Title of the dialog for fingerprint verification */
"Verify Fingerprint" = "验证指纹";

/* when displaying version numbers such as 1.0.0 */
"Version" = "版本";

/* The label for a button to view the buddy profile */
"View Profile" = "View Profile";

/* Describe how to change a contact's device settings */
"View profile to review contact's devices or change encryption settings." = "View profile to review contact's devices or change encryption settings.";

/* Label text for when a transfer has not started yet */
"Waiting" = "Waiting";

/* This string follows a user's dislplay name or username ex Bob wants to chat. */
"wants to chat." = "wants to chat.";

/* help text for password generator */
"We can automatically generate you a secure password. If you choose your own, make sure it's a unique password you don't use anywhere else." = "We can automatically generate you a secure password. If you choose your own, make sure it's a unique password you don't use anywhere else.";

/* Error message for not finding any devices */
"We could not find any trusted devices for this account." = "We could not find any trusted devices for this account.";

/* Error message for not finding any devices */
"We could not find any trusted devices for this contact." = "We could not find any trusted devices for this contact.";

/* actionsheet for showing uservoice feedback service */
"Would you like to connect to UserVoice to send feedback?" = "您是否希望链接到UserVoice来发送反馈?";

/* Title for xmpp accounts that connect through the Tor network */
"XMPP + Tor" = "XMPP + Tor";

/* String used when onboarding works */
"You're ready to use" = "You're ready to use";

/* Message shown when about to donate */
"Your donation will help fund the continued development of ChatSecure." = "您的捐助将帮助 ChatSecure 的长期发展。";

/* Text that describes what remembering your passphrase does */
"Your password will be stored in the iOS Keychain of this device only, and is only as safe as your device passphrase or pin. However, it will not persist during a device backup/restore via iTunes, so please don't forget it, or you may lose your conversation history." = "您的密码将被只储存在该设备的iOS钥匙链中,它和您的设备密码／pin一样安全.无论如何，它无法通过设备备份／恢复来保留。所以请不要忘记它，否则您将丢失您的历史会话。";

